//
// This file contains an 'Intel Peripheral Driver' and is
// licensed for Intel CPUs and chipsets under the terms of your
// license agreement with Intel or your vendor.  This file may
// be modified by the user, subject to additional terms of the
// license agreement
//
// *++
//
// Copyright (c) 1999 - 2016 Intel Corporation. All rights reserved
// This software and associated documentation (if any) is furnished
// under a license and may only be used or copied in accordance
// with the terms of the license. Except as permitted by such
// license, no part of this software or documentation may be
// reproduced, stored in a retrieval system, or transmitted in any
// form or by any means without the express written consent of
// Intel Corporation.
//
//
// Module Name:
//
//   KtiDfxSetupStrings.uni
//
// Abstract:
//
//   String definitions for KTI Dfx Setup formset.
//
// Revision History:
//
// --*/

/=#

#langdef   en-US "English"

#string STR_KTI_DFX_CONFIG_FORM_TITLE                   #language en-US "UPI Dfx Configuration"
#string STR_KTI_DFX_CONFIG_FORM_HELP                    #language en-US "Displays and provides option to change the UPI Dfx Settings"

#string STR_DFX_HALT_LINK_FAIL_RESET                    #language en-US "Halt at UPI Link Train Failure"
#string STR_DFX_HALT_LINK_FAIL_RESET_HELP               #language en-US "Halt when link failed to train. Topology changed across reset. See the serial output"

#string STR_DFX_KTI_MAX_INIT_ABORT                      #language en-US "UPI MaxInitAbort"
#string STR_DFX_KTI_MAX_INIT_ABORT_HELP                 #language en-US "UPI MaxInitAbort"

#string STR_DFX_LLC_SHARE_DRD_CRD                       #language en-US "LlcShareDrdCrd"
#string STR_DFX_LLC_SHARE_DRD_CRD_HELP                  #language en-US "Enable migration from SF to LLC and to leave shared lines in the LLC for Drd and Crd: Enable (1), Disable (0), Auto"

#string STR_DFX_BIAS_FWD_MODE                    #language en-US "CBo Bias Fwd Mode"
#string STR_DFX_BIAS_FWD_MODE_HELP               #language en-US "0 - Mode 0 (Fwd only when Hom != Req, Default); 1 - Mode 1 (Fwd when Hom != Req & Hom != Local); 2 - Mode 2 (Disable Bias Fwd)"
#string STR_DFX_MODE0                                   #language en-US "Mode0"
#string STR_DFX_MODE1                                   #language en-US "Mode1"
#string STR_DFX_MODE2                                   #language en-US "Mode2"
#string STR_DFX_MODE3                                   #language en-US "Mode3"
#string STR_DFX_MODE4                                   #language en-US "Mode4"

#string STR_DFX_SNOOP_FANOUT                            #language en-US "Snoop Fanout"
#string STR_DFX_SNOOP_FANOUT_HELP                       #language en-US "Snoop Fanout"

#string STR_DFX_HITME                                   #language en-US "Hit Me"
#string STR_DFX_HITME_HELP                              #language en-US "CHA HitME Cache Enable"

#string STR_DFX_FORCE_FWD_INV                           #language en-US "Enable Force FwdInvItoE"
#string STR_DFX_FORCE_FWD_INV_HELP                      #language en-US "Enable Force FwdInvItoE"

#string STR_DFX_DBP_ENABLE                              #language en-US "DBP Enabled"
#string STR_DFX_DBP_ENABLE_HELP                         #language en-US "DBP Enabled"

#string STR_DFX_OSB_ENABLE                              #language en-US "OSB Enabled"
#string STR_DFX_OSB_ENABLE_HELP                         #language en-US "OSB Enabled"

#string STR_DFX_HITME_RFO_DIRS_ENABLE                   #language en-US "HitME RFO DirS Enabled"
#string STR_DFX_HITME_RFO_DIRS_ENABLE_HELP              #language en-US "Enable HitME DIR=S RFO optimization"

#string STR_DFX_GATE_OSB_IODC_ALLOC_ENABLE              #language en-US "Gate OSB IODC Allocation Enabled"
#string STR_DFX_GATE_OSB_IODC_ALLOC_ENABLE_HELP         #language en-US "When OSB indicates that there aren't enough snoop credits don't allocate IODC entry."

#string STR_KTI_DFX_CPU0_LINK0                          #language en-US "CPU 0 UPI Port 0 DFX"
#string STR_KTI_DFX_CPU0_LINK1                          #language en-US "CPU 0 UPI Port 1 DFX"
#string STR_KTI_DFX_CPU0_LINK2                          #language en-US "CPU 0 UPI Port 2 DFX"
#string STR_KTI_DFX_CPU1_LINK0                          #language en-US "CPU 1 UPI Port 0 DFX"
#string STR_KTI_DFX_CPU1_LINK1                          #language en-US "CPU 1 UPI Port 1 DFX"
#string STR_KTI_DFX_CPU1_LINK2                          #language en-US "CPU 1 UPI Port 2 DFX"
#string STR_KTI_DFX_CPU2_LINK0                          #language en-US "CPU 2 UPI Port 0 DFX"
#string STR_KTI_DFX_CPU2_LINK1                          #language en-US "CPU 2 UPI Port 1 DFX"
#string STR_KTI_DFX_CPU2_LINK2                          #language en-US "CPU 2 UPI Port 2 DFX"
#string STR_KTI_DFX_CPU3_LINK0                          #language en-US "CPU 3 UPI Port 0 DFX"
#string STR_KTI_DFX_CPU3_LINK1                          #language en-US "CPU 3 UPI Port 1 DFX"
#string STR_KTI_DFX_CPU3_LINK2                          #language en-US "CPU 3 UPI Port 2 DFX"
#string STR_KTI_DFX_CPU4_LINK0                          #language en-US "CPU 4 UPI Port 0 DFX"
#string STR_KTI_DFX_CPU4_LINK1                          #language en-US "CPU 4 UPI Port 1 DFX"
#string STR_KTI_DFX_CPU4_LINK2                          #language en-US "CPU 4 UPI Port 2 DFX"
#string STR_KTI_DFX_CPU5_LINK0                          #language en-US "CPU 5 UPI Port 0 DFX"
#string STR_KTI_DFX_CPU5_LINK1                          #language en-US "CPU 5 UPI Port 1 DFX"
#string STR_KTI_DFX_CPU5_LINK2                          #language en-US "CPU 5 UPI Port 2 DFX"
#string STR_KTI_DFX_CPU6_LINK0                          #language en-US "CPU 6 UPI Port 0 DFX"
#string STR_KTI_DFX_CPU6_LINK1                          #language en-US "CPU 6 UPI Port 1 DFX"
#string STR_KTI_DFX_CPU6_LINK2                          #language en-US "CPU 6 UPI Port 2 DFX"
#string STR_KTI_DFX_CPU7_LINK0                          #language en-US "CPU 7 UPI Port 0 DFX"
#string STR_KTI_DFX_CPU7_LINK1                          #language en-US "CPU 7 UPI Port 1 DFX"
#string STR_KTI_DFX_CPU7_LINK2                          #language en-US "CPU 7 UPI Port 2 DFX"

#string STR_KTI_DFX_CPU0_LINK0_HELP                    #language en-US "CPU 0 UPI Port 0 DFX Configuration"
#string STR_KTI_DFX_CPU0_LINK1_HELP                    #language en-US "CPU 0 UPI Port 1 DFX Configuration"
#string STR_KTI_DFX_CPU0_LINK2_HELP                    #language en-US "CPU 0 UPI Port 2 DFX Configuration"
#string STR_KTI_DFX_CPU1_LINK0_HELP                    #language en-US "CPU 1 UPI Port 0 DFX Configuration"
#string STR_KTI_DFX_CPU1_LINK1_HELP                    #language en-US "CPU 1 UPI Port 1 DFX Configuration"
#string STR_KTI_DFX_CPU1_LINK2_HELP                    #language en-US "CPU 1 UPI Port 2 DFX Configuration"
#string STR_KTI_DFX_CPU2_LINK0_HELP                    #language en-US "CPU 2 UPI Port 0 DFX Configuration"
#string STR_KTI_DFX_CPU2_LINK1_HELP                    #language en-US "CPU 2 UPI Port 1 DFX Configuration"
#string STR_KTI_DFX_CPU2_LINK2_HELP                    #language en-US "CPU 2 UPI Port 2 DFX Configuration"
#string STR_KTI_DFX_CPU3_LINK0_HELP                    #language en-US "CPU 3 UPI Port 0 DFX Configuration"
#string STR_KTI_DFX_CPU3_LINK1_HELP                    #language en-US "CPU 3 UPI Port 1 DFX Configuration"
#string STR_KTI_DFX_CPU3_LINK2_HELP                    #language en-US "CPU 3 UPI Port 2 DFX Configuration"
#string STR_KTI_DFX_CPU4_LINK0_HELP                    #language en-US "CPU 4 UPI Port 0 DFX Configuration"
#string STR_KTI_DFX_CPU4_LINK1_HELP                    #language en-US "CPU 4 UPI Port 1 DFX Configuration"
#string STR_KTI_DFX_CPU4_LINK2_HELP                    #language en-US "CPU 4 UPI Port 2 DFX Configuration"
#string STR_KTI_DFX_CPU5_LINK0_HELP                    #language en-US "CPU 5 UPI Port 0 DFX Configuration"
#string STR_KTI_DFX_CPU5_LINK1_HELP                    #language en-US "CPU 5 UPI Port 1 DFX Configuration"
#string STR_KTI_DFX_CPU5_LINK2_HELP                    #language en-US "CPU 5 UPI Port 2 DFX Configuration"
#string STR_KTI_DFX_CPU6_LINK0_HELP                    #language en-US "CPU 6 UPI Port 0 DFX Configuration"
#string STR_KTI_DFX_CPU6_LINK1_HELP                    #language en-US "CPU 6 UPI Port 1 DFX Configuration"
#string STR_KTI_DFX_CPU6_LINK2_HELP                    #language en-US "CPU 6 UPI Port 2 DFX Configuration"
#string STR_KTI_DFX_CPU7_LINK0_HELP                    #language en-US "CPU 7 UPI Port 0 DFX Configuration"
#string STR_KTI_DFX_CPU7_LINK1_HELP                    #language en-US "CPU 7 UPI Port 1 DFX Configuration"
#string STR_KTI_DFX_CPU7_LINK2_HELP                    #language en-US "CPU 7 UPI Port 2 DFX Configuration"

#string STR_DFX_KTI_CRC_MODE_HELP                       #language en-US "Select UPI CRC Mode"
#string STR_DFX_KTI_CRC_MODE                            #language en-US "CRC Mode"
#string STR_DFX_KTI_16BIT_CRC                           #language en-US "16 Bit CRC"
#string STR_DFX_KTI_32BIT_ROLLING                       #language en-US "32 Bit Rolling CRC"

#string STR_DFX_KTI_L0P_HELP                            #language en-US "Enable/Disable per port L0p mode at transmitter which will be ANDed together with the exchanged value of the connected port to determine if the link may enter L0p."
#string STR_DFX_KTI_L0P                                 #language en-US "L0p enabled"

#string STR_DFX_KTI_L1_HELP                             #language en-US "Enable/Disable per port L1 which will be ANDed together with the exchanged value of the connected port to determine if the link may enter L1."
#string STR_DFX_KTI_L1                                  #language en-US "L1 enabled"

#string STR_DFX_KTI_FAILOVER_ENABLE_HELP                #language en-US "UPI Data Failover"
#string STR_DFX_KTI_FAILOVER_ENABLE                     #language en-US "UPI Failover Support"

#string STR_DFX_DUAL_LINK_INTLV_MODE                    #language en-US "Dual Link Interleave Mode"
#string STR_DFX_DUAL_LINK_INTLV_MODE_HELP               #language en-US "Only valid in 2 Socket 2 Link Topology"
#string STR_DFX_CHA_INTLV                               #language en-US "Enable CHA interleaving (disable SNC, XOR-based Intlv)"
#string STR_DFX_DISABLE_D2C                             #language en-US "Disable D2C"

#string STR_KTI_DFX_SYSTEM_DEGRADE_MODE                 #language en-US "DfxSystemDegradeMode"
#string STR_KTI_DFX_SYSTEM_DEGRADE_MODE_HELP            #language en-US "System topology degrade mode options."
#string STR_DEGRADE_TO_1S                               #language en-US "Degrade_to_1S"
#string STR_DEGARDE_TO_SUPPORTED                        #language en-US "Degarde_to_Supported"
#string STR_NO_DEGRADE                                  #language en-US "No_Degrade"

#string STR_DFX_VN1                                     #language en-US "VN1"
#string STR_DFX_VN1_HELP                                #language en-US "VN1"

#string STR_DFX_D2C                                     #language en-US "Direct To Core (D2C)"
#string STR_DFX_D2C_HELP                                #language en-US "Direct To Core (D2C)"

#string STR_DFX_D2C_THLD                                #language en-US "Direct To Core (D2C) Threshold"
#string STR_DFX_D2C_THLD_HELP                           #language en-US "Direct To Core (D2C) Threshold: 2 - 8; default is 2."

#string STR_DFX_D2K                                     #language en-US "Direct To UPI (D2K)"
#string STR_DFX_D2K_HELP                                #language en-US "Direct To UPI (D2K)"
//
// End of file
//

